----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/echow/QSU/SEER-medicare/code/000_get_pedsf.log
  log type:  text
 opened on:  26 Jun 2018, 14:31:15

. local start = "$S_TIME"

. 
. * ------------------------------------------------------------------------------
. * SEER Medicare clean up
. * Eric Chow, 04-27-2017
. *
. * appends the 6 pedsf files that list all the cancer cases (cancer dgn file)
. * these files were obtained by running the SAS scripts provided by medicare
. * destring, and subsets the population
. * ------------------------------------------------------------------------------
. 
. set more off

. 
. clear 

. clear mata

. clear matrix

. set maxvar 10000 


. 
. * ---------------------------------
. * this program opens the pedsf file
. * selects vars, destrings them and
. * saves to a smaller dta.
. 
. capture program drop clean_pedsf

. program define clean_pedsf
  1.         args filepath
  2.         
.         use "`filepath'"
  3. 
.         keep oshufcase patient_id mat_type ///
>                  med_dodm med_dodd med_dody   ///
>                  birthm birthyr yr_brth s_sex race rac_rec* srace agedx* ///
>                  state county urbrur urban ///
>                  med_stcd medst_yr icd_code cod10v cod89v /// 
>                  count resnrec marst* nosrg* rad* radbrn* radsurg* sssurg* sxsco
> p* sxsite* ///
>                  reg* seq* modx* yrdx* site* gho* mon* lat* hist* histrec* ///
>                  beh* grade* dxconf* src* e10* cstum* ///
>                  typefu* ///
>                  hstst* ajccstg* aj3sr* frstprm* summ2k* vsrtdx* intprim* ///
>                  srvm* monrx* yearrx* 
  4.          
.         encode mat_type, gen(mat_type_)
  5.         drop mat_type
  6. 
.         quietly destring  s_sex race med_stcd medst_yr ///
>          srace count resnrec ///
>          state county urbrur urban ///
>          rac_rec* icd_code cod* registry* reg2cd* reg* /// 
>         marst* agedx* seq*  site* sssurg* sxscop* sxsite* ///
>         lat* hist* beh* hist* grade* dxconf* src* e10* cstum* nosrg* rad* typefu
> *  ///
>         aj3sr* hstst* ajccstg* frstprm* summ2k* vsrtdx* intprim* srvm* monrx* ye
> arrx* , replace
  7.          
.         saveold "`filepath'_small", v(12) replace
  8. end

. 
. 
. 
. * -------------------------------------------------------
. * open 6 files!
. 
. clean_pedsf "/Volumes/QSU/Datasets/SEER_medicare/pedsf/pedsf_01"
(saving in Stata 12 format, which can be read by Stata 11 or 12)
file /Volumes/QSU/Datasets/SEER_medicare/pedsf/pedsf_01_small.dta saved

. clean_pedsf "/Volumes/QSU/Datasets/SEER_medicare/pedsf/pedsf_02"
(saving in Stata 12 format, which can be read by
 Stata 11 or 12)
file /Volumes/QSU/Datasets/SEER_medicare/pedsf/peds
> f_02_small.dta saved

. clean_pedsf "/Volumes/QSU/Datasets/SEER_medicare/
> pedsf/pedsf_03"
(saving in Stata 12 format, which can be read by
 Stata 11 or 12)
file /Volumes/QSU/Datasets/SEER_medicare/pedsf/peds
> f_03_small.dta saved

. clean_pedsf "/Volumes/QSU/Datasets/SEER_medicare/
> pedsf/pedsf_04"
(saving in Stata 12 format, which can be read by
 Stata 11 or 12)
file /Volumes/QSU/Datasets/SEER_medicare/pedsf/peds
> f_04_small.dta saved

. clean_pedsf "/Volumes/QSU/Datasets/SEER_medicare/
> pedsf/pedsf_05"
(saving in Stata 12 format, which can be read by
 Stata 11 or 12)
file /Volumes/QSU/Datasets/SEER_medicare/pedsf/peds
> f_05_small.dta saved

. clean_pedsf "/Volumes/QSU/Datasets/SEER_medicare/
> pedsf/pedsf_06"
(saving in Stata 12 format, which can be read by
 Stata 11 or 12)
file /Volumes/QSU/Datasets/SEER_medicare/pedsf/peds
> f_06_small.dta saved

. 
. 
. * -----------------------------------------------
> --------
. * append the 6 files
. 
. use "/Volumes/QSU/Datasets/SEER_medicare/pedsf/pe
> dsf_01_small", clear

. gen file = 1

. append using "/Volumes/QSU/Datasets/SEER_medicare
> /pedsf/pedsf_02_small"
(label mat_type_ already defined)

. replace file = 2 if missing(file)
(106,000 real changes made)

. append using "/Volumes/QSU/Datasets/SEER_medicare
> /pedsf/pedsf_03_small"
(label mat_type_ already defined)

. replace file = 3 if missing(file)
(106,000 real changes made)

. append using "/Volumes/QSU/Datasets/SEER_medicare
> /pedsf/pedsf_04_small"
(note: variable site10 was byte, now int to
       accommodate using data's values)
(note: variable hist2_10 was byte, now int to
       accommodate using data's values)
(note: variable hist10 was byte, now int to
       accommodate using data's values)
(note: variable siterwho10 was byte, now int to
       accommodate using data's values)
(note: variable srvm7 was byte, now int to
       accommodate using data's values)
(note: variable yearrx10 was byte, now int to
       accommodate using data's values)
(label mat_type_ already defined)

. replace file = 4 if missing(file)
(106,000 real changes made)

. append using "/Volumes/QSU/Datasets/SEER_medicare
> /pedsf/pedsf_05_small"
(note: variable cstum10 was byte, now int to
       accommodate using data's values)
(note: variable siterwho7 was int, now long to
       accommodate using data's values)
(label mat_type_ already defined)

. replace file = 5 if missing(file)
(106,000 real changes made)

. append using "/Volumes/QSU/Datasets/SEER_medicare
> /pedsf/pedsf_06_small"
(label mat_type_ already defined)

. replace file = 6 if missing(file)
(9,534 real changes made)

. 
. 
. saveold "/Volumes/QSU/Datasets/SEER_medicare/peds
> f/pedsf_small", v(12) replace
(saving in Stata 12 format, which can be read by
 Stata 11 or 12)
file /Volumes/QSU/Datasets/SEER_medicare/pedsf/pedsf_small.dta saved

. 
. 
. log close
      name:  <unnamed>
       log:  /Users/echow/QSU/SEER-medicare/code/000_get_pedsf.log
  log type:  text
 closed on:  26 Jun 2018, 16:13:53
---------------------------------------------------------------------------------------
